# Getting and Knowing Data

In [1]:
import pandas as pd
import numpy as np

## Step 1: import dataset

In [64]:
df = pd.read_csv("data/chipotle.tsv", sep="\t")

In [65]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step2: Data Overview

In [12]:
df.shape

(4622, 5)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [18]:
#print all columns ' name
df.columns
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [19]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [25]:
#print statistical, default number
df.describe(include ="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### location vs Ilocation

In [27]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [37]:
#select all rowss with multiple conÄ‘ition
df.loc[(df.quantity ==15) | (df.item_name=="Nantucket Nectar"), ["order_id","quantity","item_name"]]

      order_id  quantity                     item_name
2            1         1              Nantucket Nectar
22          11         1              Nantucket Nectar
105         46         1              Nantucket Nectar
173         77         1              Nantucket Nectar
205         91         1              Nantucket Nectar
436        189         1              Nantucket Nectar
601        247         2              Nantucket Nectar
925        381         1              Nantucket Nectar
1356       553         1              Nantucket Nectar
1585       641         1              Nantucket Nectar
1626       656         1              Nantucket Nectar
1706       690         1              Nantucket Nectar
2162       872         1              Nantucket Nectar
2379       947         2              Nantucket Nectar
2381       947         1              Nantucket Nectar
2430       965         1              Nantucket Nectar
2653      1053         1              Nantucket Nectar
2818      1118         1              Nantucket Nectar
2838      1128         1              Nantucket Nectar
2853      1133         1              Nantucket Nectar
2949      1172         1              Nantucket Nectar
3318      1330         1              Nantucket Nectar
3368      1351         1              Nantucket Nectar
3570      1433         1              Nantucket Nectar
3598      1443        15  Chips and Fresh Tomato Salsa
3845      1541         1              Nantucket Nectar
4019      1609         1              Nantucket Nectar
4078      1632         1              Nantucket Nectar

In [39]:
#select row 10
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [40]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [44]:
x=df.iloc[3:5, : -1] #except lastest column
y = df.iloc[3:5, -1] #only lastest column
print(y)

3     $2.39
4    $16.98
Name: item_price, dtype: object

In [45]:
#check datatype
df.item_price.dtype

dtype('O')

### Apply()

In [66]:
df.item_price = df.item_price.apply(lambda x: float(x.replace("$","")))

In [67]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [70]:
#create new row and column
df["total_price"]= df["quantity"] * df["item_price"]
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

# How much was the revenue for the period in the dataset?

In [71]:
revenue=df["total_price"].sum()
print(revenue)

39237.02

## Which wass the mosst orrdered item?

### Group By

In [78]:
c=df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

# Unique Value

In [80]:
df.item_name.value_counts().count()

np.int64(50)

In [82]:
df.item_name.nunique()

50